test.jag

<%

var SAML_RESPONSE_TOKEN_SESSION_KEY = "SAML_TOKEN";
var SAML_ASSERTION_TOKEN_SESSION_KEY = "SAML_ASSERTION_TOKEN";
var  SSO_NAME = "SSORelyingParty.Name";

var updateBackendCookie = function (serverUrl) {
    var token = getToken();
    var encodedToken = token && token.replace(/>/g, '&gt;').replace(/</g,'&lt;');
    var xhr = new XMLHttpRequest();
    xhr.setRequestHeader('SOAPAction', 'urn:login');
    xhr.setRequestHeader('Content-Type', 'application/soap+xml');
    var endPoint = "https://10.10.10.199:9443/admin/services/"+"SAML2SSOAuthenticationService";
    xhr.open("POST", endPoint);
    var payload = '<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:sso="http://sso.saml2.authenticator.identity.carbon.wso2.org" xmlns:xsd="http://dto.sso.saml2.authenticator.identity.carbon.wso2.org/xsd"><soap:Header/><soap:Body><sso:login><sso:authDto><xsd:response>' + encodedToken + '</xsd:response></sso:authDto></sso:login></soap:Body></soap:Envelope>';
    xhr.send(payload);
    var cookieString = xhr.getResponseHeader("Set-Cookie");
    var cookie = cookieString.split(";")[0];
    print(cookie.toString());
   // return cookie.toString();
};


var getToken = function (){
    if(session.get(SAML_RESPONSE_TOKEN_SESSION_KEY)){
        return session.get(SAML_RESPONSE_TOKEN_SESSION_KEY);
    } else if(session.get(SAML_ASSERTION_TOKEN_SESSION_KEY)){
        return session.get(SAML_ASSERTION_TOKEN_SESSION_KEY);
    } else {
        return null;
    }
}

updateBackendCookie();
%>
